<template>
  <div @click="changeData" class="test-button">更新数据</div>
  <div class="test-main">
    <div class="test-content">
      <BarChartMultiple :option="barChartVertical"></BarChartMultiple>
      <BarChartVertical :option="barChartVertical"></BarChartVertical>
      <LineChartMultiple :option="barChartVertical"></LineChartMultiple>
      <BarChartHorizontal :option="barChartHorizontal"></BarChartHorizontal>
      <PieChartNew :option="pieOption"></PieChartNew>

      <ScatterChartNew :option="scatterOption"></ScatterChartNew>

      <HeadingTwo :option="this.heading"></HeadingTwo>
<!--      <HeadingThree :option="this.heading"></HeadingThree>-->
<!--      <HeadingOne :option="this.headingOne"></HeadingOne>-->
<!--      <ProgressBarOne-->
<!--          :option=this.progress-->
<!--      ></ProgressBarOne>-->

<!--      <ProgressBarTwo-->
<!--          :option=this.progress-->
<!--      ></ProgressBarTwo>-->
<!--      <FunnelChart :option=this.funnelTest></FunnelChart>-->
    </div>
  </div>
</template>
<script setup>
</script>
<script>
import {components} from "@/components/common/components";

export default {
   components: {
    BarChartVertical: components.BarChartVertical,
    ScatterChartNew: components.ScatterChartNew,
    LineChartMultiple: components.LineChartMultiple,
    BarChartMultiple: components.BarChartMultiple,
    BarChartHorizontal: components.BarChartHorizontal,
    PieChartNew: components.PieChartNew,
    HeadingTwo: components.HeadingTwo,
  },
  name: 'TestView',
  data() {
    return {
      bool: false,
      barChartVertical: {
        color: 1,
        height: '350',
        yStart: 0,
        yEnd: null,
        xRotate: 'ceshi',
        xInterval: 0,
        isPercentage: true,
      },
      pieOption: {
        data: [
          ['name', 'value'],
          ['虎丘区测试', 46.39],
          ['吴中区', 13.26],
          ['相城区', 7.46],
          ['姑苏区', 6.47],
          ['吴江区', 3.17],
          ['昆山市', 2.56],
          ['其他测试', 0.7]
        ],
        isHalf: true,
      },
      // chartHeight: '750px',
      // itemStyle: {
      //   borderRadius: 8,
      //   borderColor: '#fff',
      //   borderWidth: 2
      // },
      // progress: {
      //   value: 0.95,
      //   leftCornerText: '左标1',
      //   rightCornerText: '右标',
      // },
      heading: {text: '测试一下'},
      // headingOne: {text: '测试一下', number: "01"},
      barChartHorizontal: {
        data: [['总客流人数', 1], ['进店人数', 2.38], ['流人数', 0.00008], ['流人数1', 0.18], ['流人数2', 0.08]],
      },
      // funnelTest: {data: [['总客流人数', 100], ['进店人数', 60], ['流人数1123', 30], ['流人数112', 15]]},
      //
      scatterOption: {
        data: [
          ['date', '12a', '1a', '1a', '1a', '4a', '5a', '6a', '7a', '8a', '9a', '10a', '11a', '12p', '1p', '2p', '3p', '4p', '5p', '6p', '7p', '8p', '9p', '10p', '11p'],
          ['2024/8/1', '22', '2', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '11', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/2', '1', '2', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '20', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/3', '1', '2', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '19', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/4', '1', '3', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '18', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/5', '1', '3', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '17', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/6', '1', '4', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '16', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/7', '1', '5', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '15', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/8', '1', '6', '2', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '14', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/9', '1', '7', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '13', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/10', '1', '8', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '12', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/11', '1', '9', '1', '1', '1', '1', '3', '4', '5', '1', '1', '1', '1', '1', '1', '11', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/12', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '10', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/13', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '19', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/14', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '18', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/15', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '17', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/16', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '8', '1', '1', '16', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/17', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '15', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/18', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '14', '1', '10', '1', '1', '1', '1', '1', '1'],
          ['2024/8/19', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '13', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/20', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '12', '1', '11', '1', '1', '1', '1', '1', '1'],
          ['2024/8/21', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '23', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/22', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '23', '23', '23', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/23', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '13', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/24', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '13', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/25', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '6', '1', '11', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/26', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '12', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/27', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '11', '1', '1', '17', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/28', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '17', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/29', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '19', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/30', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '11', '1', '1', '1', '1', '1', '1', '1', '1'],
          ['2024/8/31', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '12', '1', '1', '1', '1', '1', '1', '1', '1']
        ],
        height: 300,
        color: 3
      }
    }
  },
  methods: {
    changeData() {
      this.bool = !this.bool
      this.barChartVertical = {
        data: [
          ['category', '7月', '8月'],
          ['20-29岁', 41, 37.64],
          ['30-39岁', 52, 47.64],
          ['40-49岁', 19.06, 27.64],
          ['50-59岁', 11.41, 17.64],
          ['60-69岁', 1.33, 22.64],
          ['70岁以上', 0.96, 9.64]
        ],
        color: 2,
        height: 450,
        yStart: 0,
        yEnd: '',
        xRotate: 0,
        xInterval: 0,
        isPercentage: this.bool,
        heading: '测试一下',
        isShowLegend: this.bool,
      }

      this.pieOption.isHalf = false

      this.barChartHorizontal = {
        labelSuffix: '%',
        data: [['总客流人数', 1], ['进店人数', 2.38], ['流人数2', 0.28], ['流人数12121212', 0.18], ['流人数22', 2.08]],
        color: 2,
        text: '测试一下测试一下',
        heading: '标题',
        isPercentage: true,
      }

      this.scatterOption.color = 1
      //
      // this.funnelTest = {data: [['总客流人数', 100], ['进店人数', 60], ['流人数112', 30], ['流人数1123123', 15], ['流人数223123123123', 7]]}
      // this.progress = {
      //   value: 0.55,
      //   leftCornerText: '测试一下',
      //   rightCornerText: '测试',
      // }
      // this.heading = {text: '测试一下测试一下测试一下'}
      // this.headingOne = {text: '测试一下测试一下测试一下', number: "02"}
    }
  },
  computed: {},
  watch: {},
}

</script>
<style lang="scss" scoped>
.test-main {
  width: 100%;
  background-color: gray;
}
.test-content {
  width: 750px;
  padding: 0 40px;
  background-color: white;
}

.test-button {
  background-color: lightBlue;
  position: fixed;
  padding: 4px 12px;
  border-radius: 50px;
  top: 10px;
  right: 100px;
  z-index: 1000;
  /*float: right;*/
}

</style>
